<!-- dflook/terraform-github-actions {"workspace":"bookworm-base","backend_type":"remote","plan_modifier":"e3630f9001b9936667c4e3e06530ade2c1fc9a214786147ee8133ccbea4f2d1c","backend":"71d0b09c289c0e18110c33fe92d721192d03e315ab665d5233caf64bb8398beb","plan_job_ref":"Job Test actions using target and replace #504 at https://github.com/dflook/terraform-github-actions/actions/runs/15345085174","plan_hash":"a79f8ac0ecc878b675d9833dc3dc5fb9f1a8d4da949393a545c3f5af6e6991d7","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __bookworm-base__ workspace
Targeting resources: `random_string.foreach["hello"]`
With variables: `length = 6`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_string.foreach["hello"] will be created
+   resource "random_string" "foreach" {
+       id          = (known after apply)
+       length      = 6
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   foreach = (known after apply)
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 		
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
```
</details>

:memo: Plan generated in [Test actions using target and replace #504](https://github.com/dflook/terraform-github-actions/actions/runs/15345085174)